Revit 2027 API
BuiltInFailures.DesignOptionFailures.MustBeInMainModel Property
 Element must be in Main Model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MustBeInMainModel { get; }
Public Shared ReadOnly Property MustBeInMainModel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MustBeInMainModel {
	FailureDefinitionId^ get ();
}
static member MustBeInMainModel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace